#include <iostream>

int main() {
    std::cout << "Задание 1. Запасы продовольствия\n";

    int buskweat = 100;

    std::cout << "Всего гречки было на начало подсчёта: "<< buskweat << "кг.\n";

    for (int i = 1; buskweat > 0 ; ++i) {
        buskweat -= 4;
        std::cout << "После "<< i <<" месяца у вас в запасе останется "<< buskweat <<" кг гречки.\n";
    }

    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 2. Кофемашина\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 3. Красный Марс\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 4. Рамка\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 5. Координатные оси\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 6. Важные объявления\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 7. Биолаборатория* (дополнительное задание)\n";



    std::cout << "-----------------------------------------------------------------\n";

    std::cout << "Задание 8. Ёлочка* (дополнительное задание)\n";



    std::cout << "-----------------------------------------------------------------\n";

    return 0;
}
